read_verilog test_designs/combinatorial/2_bit_full_adder.v
hierarchy -check
# translate processes
proc; opt
# convert to gate logic
techmap; opt

# map logic to cmos cells
abc -g NAND

write_edif netlists/2_bit_full_adder.edif
