read_verilog test_designs/combinatorial/c17.v
# read_verilog -lib cell_libs/nand_only.v
hierarchy -check
# translate processes
proc; opt
# convert to gate logic
techmap; opt
# map logic to cmos cells
# abc -liberty cell_libs/nand_only.lib
abc -g NAND

#write_blif main.blif
#write_spice main.spice
write_edif c17.edif
#write_intersynth main.intersynth
#write_verilog main.v
