# this is a template
# T_* need to be replaced
read_verilog T_VERILOG_PATH
hierarchy -check -top circuit
proc
techmap

write_edif T_EDIF_PATH
