# this is a template
# T_* need to be replaced
read_verilog T_VERILOG_PATH
# read_verilog -lib cell_libs/nand_only.v
hierarchy -check
# translate processes
proc
# convert to gate logic
techmap

abc -g NAND

write_edif T_EDIF_PATH
